import { translate } from "@docusaurus/Translate";

export const DEFAULT_FAVORITE_IDS = [2, 209, 197, 109, 20, 1, 251];
export const DEFAULT_IDS = [2, 185, 209, 197, 109, 20, 1, 251, 199, 90, 180, 232, 4, 204, 218, 41, 11, 234];
export const ALL_IDS = [
  2, 185, 209, 197, 109, 20, 1, 251, 199, 90, 180, 232, 4, 204, 218, 41, 11, 234, 206, 196, 9, 17, 8, 256, 173, 7, 219, 210, 155, 214, 212, 56, 224, 220, 177, 5, 10, 15, 187, 266, 122, 80, 217, 159,
  21, 242, 238, 94, 277, 19, 205, 181, 171, 200, 14, 13, 139, 49, 142, 132, 191, 190, 63, 48, 91, 158, 222, 75, 221, 95, 16, 6, 267, 141, 18, 176, 120, 253, 195, 182, 89, 3, 264, 255, 152, 73, 82, 24,
  188, 125, 145, 241, 93, 50, 237, 23, 194, 40, 138, 160, 233, 77, 259, 236, 202, 42, 258, 243, 12, 215, 103, 192, 265, 112, 257, 250, 239, 216, 184, 163, 126, 35, 228, 98, 275, 262, 87, 162, 189,
  270, 157, 147, 151, 211, 57, 193, 175, 46, 179, 72, 261, 130, 74, 254, 167, 150, 198, 97, 134, 66, 178, 101, 88, 137, 203, 106, 269, 47, 67, 39, 273, 172, 38, 96, 235, 140, 92, 123, 144, 271, 37,
  51, 230, 240, 274, 22, 245, 78, 213, 64, 85, 248, 100, 201, 62, 71, 70, 45, 58, 186, 252, 99, 272, 226, 76, 207, 54, 28, 133, 208, 170, 86, 246, 135, 36, 25, 143, 31, 168, 153, 29, 183, 43, 146, 26,
  118, 260, 263, 53, 154, 111, 244, 229, 169, 247, 59, 119, 30, 52, 102, 81, 79, 166, 65, 124, 131, 27, 61, 68, 129, 148, 223, 231, 114, 107, 55, 84, 69, 161, 110, 115, 44, 116, 136, 164, 128, 121,
  149, 108, 249, 60, 276, 165, 32, 34, 117, 83, 113, 278, 227, 33, 268, 174, 225, 104, 105, 156, 127,
];

export const SLOGAN = translate({
  id: "homepage.slogan",
  message: "让生产力加倍的 AI 快捷指令",
});
export const TITLE = translate({
  id: "homepage.title",
  message: "AiShort(ChatGPT Shortcut)-简单易用的 AI 快捷指令表，让生产力倍增！",
});
export const DESCRIPTION = translate({
  id: "homepage.description",
  message: "AI Short 是一款用于管理和分享 AI 提示词的工具，帮助用户更有效地定制、保存和共享自己的提示词，以提高生产力。该平台还包括一个提示词分享社区，让用户轻松找到适用于不同场景的指令。",
});

// community-prompts
export const COMMU_TITLE = "AiShort Community Prompts - Share and find interesting prompts";
export const COMMU_DESCRIPTION = translate({
  id: "description.communityPrompts",
  message:
    "探索由 AiShort 用户分享的创新提示词集合，这些独特且有趣的提示词可以激发你在创作短视频、小说、游戏等内容时的灵感。投票支持你最爱的提示，将它们复制并与你的朋友分享。让 AiShort 帮助你打开创造力的大门，一起创作出色的作品吧。",
});
