import { translate } from "@docusaurus/Translate";

export const DEFAULT_FAVORITE_IDS = [2, 209, 197, 109, 20, 1, 251];
export const DEFAULT_IDS = [2, 185, 209, 197, 109, 20, 1, 251, 199, 90, 180, 232, 4, 204, 218, 41, 11, 234];
export const ALL_IDS = [
  2, 185, 209, 197, 109, 20, 1, 251, 199, 90, 180, 232, 4, 204, 218, 41, 11, 234, 206, 196, 9, 17, 8, 256, 173, 7, 219, 210, 155, 214, 212, 56, 224, 220, 177, 5, 10, 15, 187, 266, 122, 80, 217, 159,
  21, 242, 238, 94, 277, 19, 205, 181, 171, 200, 14, 13, 139, 49, 142, 132, 191, 190, 63, 48, 91, 158, 222, 75, 221, 95, 16, 6, 267, 141, 18, 176, 120, 253, 195, 182, 89, 3, 264, 255, 152, 73, 82, 24,
  188, 125, 145, 241, 93, 50, 237, 23, 194, 40, 138, 160, 233, 77, 259, 236, 202, 42, 258, 243, 12, 215, 103, 192, 265, 112, 257, 250, 239, 216, 184, 163, 126, 35, 228, 98, 275, 262, 87, 162, 189,
  270, 157, 147, 151, 211, 57, 193, 175, 46, 179, 72, 261, 130, 74, 254, 167, 150, 198, 97, 134, 66, 178, 101, 88, 137, 203, 106, 269, 47, 67, 39, 273, 172, 38, 96, 235, 140, 92, 123, 144, 271, 37,
  51, 230, 240, 274, 22, 245, 78, 213, 64, 85, 248, 100, 201, 62, 71, 70, 45, 58, 186, 252, 99, 272, 226, 76, 207, 54, 28, 133, 208, 170, 86, 246, 135, 36, 25, 143, 31, 168, 153, 29, 183, 43, 146, 26,
  118, 260, 263, 53, 154, 111, 244, 229, 169, 247, 59, 119, 30, 52, 102, 81, 79, 166, 65, 124, 131, 27, 61, 68, 129, 148, 223, 231, 114, 107, 55, 84, 69, 161, 110, 115, 44, 116, 136, 164, 128, 121,
  149, 108, 249, 60, 276, 165, 32, 34, 117, 83, 113, 278, 227, 33, 268, 174, 225, 104, 105, 156, 127,
];

export const SLOGAN = translate({
  id: "homepage.slogan",
  message: "驾驭 AI 智能体，释放十倍生产力",
});
export const TITLE = translate({
  id: "homepage.title",
  message: "AiShort - 高效 AI 智能体与提示词平台 | 构建、分享、一键倍增生产力",
});
export const DESCRIPTION = translate({
  id: "homepage.description",
  message:
    "AiShort(ChatGPT Shortcut) 是一个高效的 AI 智能体与提示词平台，致力于革新您的工作与学习方式。在这里，您不仅能发现海量高质量的提示词，更能轻松构建、管理并一键运行强大的 AI 智能体，实现复杂任务的自动化。AiShort 支持多语言环境，帮助您与 AI 进行更高效的协作。立即加入我们的创作者社区，探索和分享 AI 智能体的无限潜能，开启您的超级生产力时代！",
});

// community-prompts
export const COMMU_TITLE = translate({
  id: "community.title",
  message: "AiShort 创作者社区 - 共建与分享 AI 智能体，探索未来工作流",
});
export const COMMU_DESCRIPTION = translate({
  id: "community.description",
  message:
    "欢迎来到 AiShort 创作者社区！这里是 AI 智能体（AI Agent）和提示词爱好者与实践者的聚集地。在这里，你可以发现、分享并导入由社区成员构建的强大 AI 智能体，将它们一键应用于你的写作、编程、市场分析等工作流中。参与讨论，优化智能体方案，与其他创作者一同协作，将天马行空的创意变为高效的自动化解决方案。立即加入，分享你的第一个 AI 智能体！",
});
