import { translate } from "@docusaurus/Translate";

export const DEFAULT_FAVORITE_IDS = [2, 209, 197, 109, 251, 20, 1];
export const DEFAULT_IDS = [2, 185, 209, 197, 109, 251, 20, 1, 199, 90, 180, 232, 204, 4];
export const ALL_IDS = [
  2, 185, 209, 197, 109, 251, 20, 1, 199, 90, 180, 232, 204, 4, 218, 41, 11, 234, 206, 196, 9, 17, 8, 256, 7, 173, 219, 210, 155, 214, 212, 56, 5, 224, 177, 220, 10, 15, 187, 266, 122, 217, 159, 80,
  242, 21, 277, 94, 238, 19, 205, 181, 171, 200, 14, 139, 13, 191, 49, 142, 190, 91, 132, 63, 48, 95, 158, 222, 221, 75, 6, 267, 16, 141, 176, 18, 253, 120, 182, 89, 264, 195, 3, 255, 152, 82, 188,
  73, 93, 24, 145, 125, 241, 50, 237, 194, 23, 160, 40, 138, 233, 77, 259, 236, 202, 42, 265, 258, 12, 192, 243, 215, 257, 103, 112, 250, 239, 184, 163, 216, 275, 126, 228, 35, 98, 262, 270, 162, 189,
  87, 157, 151, 147, 175, 57, 211, 193, 261, 72, 179, 46, 97, 74, 254, 130, 150, 167, 134, 198, 178, 66, 101, 88, 273, 137, 106, 203, 269, 47, 67, 92, 39, 96, 230, 172, 38, 235, 271, 140, 123, 144,
  51, 37, 240, 274, 100, 22, 71, 245, 78, 64, 213, 201, 248, 85, 62, 70, 58, 45, 186, 252, 99, 226, 272, 207, 76, 29, 170, 54, 208, 28, 133, 246, 86, 135, 31, 36, 25, 153, 143, 168, 183, 146, 43, 154,
  118, 263, 229, 53, 26, 260, 111, 244, 169, 247, 59, 30, 52, 102, 81, 119, 79, 166, 65, 124, 131, 27, 231, 129, 61, 148, 68, 114, 223, 55, 107, 84, 161, 69, 110, 44, 115, 136, 116, 128, 164, 108, 32,
  60, 149, 276, 249, 165, 121, 34, 278, 117, 83, 113, 227, 33, 268, 225, 174, 104, 105, 156, 127,
];

export const SLOGAN = translate({
  id: "homepage.slogan",
  message: "精选 AI 提示词，让每次对话更高效",
});
export const TITLE = translate({
  id: "homepage.title",
  message: "AiShort - AI提示词模板库 | 精选Prompt指令 | 一键提升生产力",
});
export const DESCRIPTION = translate({
  id: "homepage.description",
  message: "为什么AI总是答非所问？AiShort收录实用AI提示词模板，覆盖写作、编程、翻译场景，一键复制使用，让AI精准理解指令，输出专业结果，工作效率瞬间翻倍！",
});

// community-prompts
export const COMMU_TITLE = translate({
  id: "community.title",
  message: "AI提示词社区 - 发现分享优质Prompt | AiShort创作交流平台",
});
export const COMMU_DESCRIPTION = translate({
  id: "community.description",
  message: "想要更多实战级AI提示词？加入AiShort社区，发现用户分享的实用Prompt模板，交流优化技巧，共同打造高质量提示词资源库。",
});
