import { translate } from "@docusaurus/Translate";

export const DEFAULT_FAVORITE_IDS = [2, 209, 197, 109, 251, 20, 1];
export const DEFAULT_IDS = [2, 185, 209, 197, 109, 251, 20, 1, 199, 90, 180, 232, 204, 4];
export const ALL_IDS = [
  2, 185, 209, 197, 109, 251, 20, 1, 199, 90, 180, 232, 204, 4, 218, 41, 11, 234, 206, 196, 9, 17, 8, 256, 7, 173, 219, 210, 155, 214, 212, 56, 5, 224, 177, 220, 10, 15, 187, 266, 122, 217, 159, 80,
  242, 21, 277, 94, 238, 19, 205, 181, 171, 200, 14, 139, 13, 191, 49, 142, 190, 91, 132, 63, 48, 95, 158, 222, 221, 75, 6, 267, 16, 141, 176, 18, 253, 120, 182, 89, 264, 195, 3, 255, 152, 82, 188,
  73, 93, 24, 145, 125, 241, 50, 237, 194, 23, 160, 40, 138, 233, 77, 259, 236, 202, 42, 265, 258, 12, 192, 243, 215, 257, 103, 112, 250, 239, 184, 163, 216, 275, 126, 228, 35, 98, 262, 270, 162, 189,
  87, 157, 151, 147, 175, 57, 211, 193, 261, 72, 179, 46, 97, 74, 254, 130, 150, 167, 134, 198, 178, 66, 101, 88, 273, 137, 106, 203, 269, 47, 67, 92, 39, 96, 230, 172, 38, 235, 271, 140, 123, 144,
  51, 37, 240, 274, 100, 22, 71, 245, 78, 64, 213, 201, 248, 85, 62, 70, 58, 45, 186, 252, 99, 226, 272, 207, 76, 29, 170, 54, 208, 28, 133, 246, 86, 135, 31, 36, 25, 153, 143, 168, 183, 146, 43, 154,
  118, 263, 229, 53, 26, 260, 111, 244, 169, 247, 59, 30, 52, 102, 81, 119, 79, 166, 65, 124, 131, 27, 231, 129, 61, 148, 68, 114, 223, 55, 107, 84, 161, 69, 110, 44, 115, 136, 116, 128, 164, 108, 32,
  60, 149, 276, 249, 165, 121, 34, 278, 117, 83, 113, 227, 33, 268, 225, 174, 104, 105, 156, 127,
];

export const SLOGAN = translate({
  id: "homepage.slogan",
  message: "驾驭 AI 智能体，释放十倍生产力",
});
export const TITLE = translate({
  id: "homepage.title",
  message: "AiShort - 高效 AI 智能体与提示词平台 | 构建、分享、一键倍增生产力",
});
export const DESCRIPTION = translate({
  id: "homepage.description",
  message:
    "AiShort(ChatGPT Shortcut) 是一个高效的 AI 智能体与提示词平台，致力于革新您的工作与学习方式。在这里，您不仅能发现海量高质量的提示词，更能轻松构建、管理并一键运行强大的 AI 智能体，实现复杂任务的自动化。AiShort 支持多语言环境，帮助您与 AI 进行更高效的协作。立即加入我们的创作者社区，探索和分享 AI 智能体的无限潜能，开启您的超级生产力时代！",
});

// community-prompts
export const COMMU_TITLE = translate({
  id: "community.title",
  message: "AiShort 创作者社区 - 共建与分享 AI 智能体，探索未来工作流",
});
export const COMMU_DESCRIPTION = translate({
  id: "community.description",
  message:
    "欢迎来到 AiShort 创作者社区！这里是 AI 智能体（AI Agent）和提示词爱好者与实践者的聚集地。在这里，你可以发现、分享并导入由社区成员构建的强大 AI 智能体，将它们一键应用于你的写作、编程、市场分析等工作流中。参与讨论，优化智能体方案，与其他创作者一同协作，将天马行空的创意变为高效的自动化解决方案。立即加入，分享你的第一个 AI 智能体！",
});
